ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/GPIO_GPIO_52000000h.xml
<module name="GPIO" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GPIO_PID" acronym="GPIO_PID" offset="0" width="32" description="GPIO Periperal ID Register.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Current scheme" range="31:30" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1155" description="Function code assigned to TCP3" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x5" description="RTL Version R code" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision X code" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version code" range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x5" description="Minor revision Y code" range="5:0" rwaccess="R"/>
	</register><register id="GPIO_PCR" acronym="GPIO_PCR" offset="4" width="32" description="Peripheral Control Register.">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Used in conjunction with FREE bit to determine the emulation suspend mode." range="1" rwaccess="R"/>
	<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x1" description="For GPIO, the FREE bit is fixed at 1, which means GPIO runs free in emulation suspend." range="0" rwaccess="R"/>
	</register><register id="GPIO_BINTEN" acronym="GPIO_BINTEN" offset="8" width="32" description="Bit Interrupt Enable Register.">
		<bitfield id="EN" width="16" begin="15" end="0" resetval="0x0" description="Per bank interrupt enable. 0 = disable, 1 = enable." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_DIR01" acronym="GPIO_DIR01" offset="16" width="32" description="Direction Register.">
		<bitfield id="DIR1" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 1 bits, 0 = output, 1 = input." range="31:16" rwaccess="R/W"/>
	<bitfield id="DIR0" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 0 bits, 0 = output, 1 = input." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_OUT_DATA01" acronym="GPIO_OUT_DATA01" offset="20" width="32" description="Output Drive State Register.">
		<bitfield id="OUT1" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 1 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="31:16" rwaccess="R/W"/>
	<bitfield id="OUT0" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 0 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_SET_DATA01" acronym="GPIO_SET_DATA01" offset="24" width="32" description="Set Output Drive State Register.">
		<bitfield id="SET1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 1 bits. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SET0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 0 bits. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_DATA01" acronym="GPIO_CLR_DATA01" offset="28" width="32" description="Clear Output Drive State Register.">
		<bitfield id="CLR1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLR0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_IN_DATA01" acronym="GPIO_IN_DATA01" offset="32" width="32" description="Bank Status Register.">
		<bitfield id="IN1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 1 bits." range="31:16" rwaccess="R"/>
	<bitfield id="IN0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits." range="15:0" rwaccess="R"/>
	</register><register id="GPIO_SET_RIS_TRIG01" acronym="GPIO_SET_RIS_TRIG01" offset="36" width="32" description="Set Rising Edge Detection Register.">
		<bitfield id="SETRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 1 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 0 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_RIS_TRIG01" acronym="GPIO_CLR_RIS_TRIG01" offset="40" width="32" description="Clear Rising Edge Detection Register.">
		<bitfield id="CLRRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 1 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 0 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_SET_FAL_TRIG01" acronym="GPIO_SET_FAL_TRIG01" offset="44" width="32" description="Set Falling Edge Detection Register.">
		<bitfield id="SETFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 1 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 0 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_FAL_TRIG01" acronym="GPIO_CLR_FAL_TRIG01" offset="48" width="32" description="Clear Falling Edge Detection Register.">
		<bitfield id="CLRFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 1 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 0 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_INTSTAT01" acronym="GPIO_INTSTAT01" offset="52" width="32" description="Bank Interrupt Status Register.">
		<bitfield id="STAT1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 0 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="STAT0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_DIR23" acronym="GPIO_DIR23" offset="56" width="32" description="Direction Register.">
		<bitfield id="DIR3" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 3 bits, 0 = output, 1 = input." range="31:16" rwaccess="R/W"/>
	<bitfield id="DIR2" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 2 bits, 0 = output, 1 = input." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_OUT_DATA23" acronym="GPIO_OUT_DATA23" offset="60" width="32" description="Output Drive State Register.">
		<bitfield id="OUT3" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 3 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="31:16" rwaccess="R/W"/>
	<bitfield id="OUT2" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 2 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_SET_DATA23" acronym="GPIO_SET_DATA23" offset="64" width="32" description="Set Output Drive State Register.">
		<bitfield id="SET3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 3 bits. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SET2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 2 bits. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_DATA23" acronym="GPIO_CLR_DATA23" offset="68" width="32" description="Clear Output Drive State Register.">
		<bitfield id="CLR3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLR2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_IN_DATA23" acronym="GPIO_IN_DATA23" offset="72" width="32" description="Bank Status Register.">
		<bitfield id="IN3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 3 bits." range="31:16" rwaccess="R"/>
	<bitfield id="IN2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits." range="15:0" rwaccess="R"/>
	</register><register id="GPIO_SET_RIS_TRIG23" acronym="GPIO_SET_RIS_TRIG23" offset="76" width="32" description="Set Rising Edge Detection Register.">
		<bitfield id="SETRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 3 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 2 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_RIS_TRIG23" acronym="GPIO_CLR_RIS_TRIG23" offset="80" width="32" description="Clear Rising Edge Detection Register.">
		<bitfield id="CLRRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 3 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 2 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_SET_FAL_TRIG23" acronym="GPIO_SET_FAL_TRIG23" offset="84" width="32" description="Set Falling Edge Detection Register.">
		<bitfield id="SETFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 3 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 2 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_FAL_TRIG23" acronym="GPIO_CLR_FAL_TRIG23" offset="88" width="32" description="Clear Falling Edge Detection Register.">
		<bitfield id="CLRFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 3 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 2 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_INTSTAT23" acronym="GPIO_INTSTAT23" offset="92" width="32" description="Bank Interrupt Status Register.">
		<bitfield id="STAT3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="STAT2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_DIR45" acronym="GPIO_DIR45" offset="96" width="32" description="Direction Register.">
		<bitfield id="DIR5" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 5 bits, 0 = output, 1 = input." range="31:16" rwaccess="R/W"/>
	<bitfield id="DIR4" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 4 bits, 0 = output, 1 = input." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_OUT_DATA45" acronym="GPIO_OUT_DATA45" offset="100" width="32" description="Output Drive State Register.">
		<bitfield id="OUT5" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 5 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="31:16" rwaccess="R/W"/>
	<bitfield id="OUT4" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 4 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_SET_DATA45" acronym="GPIO_SET_DATA45" offset="104" width="32" description="Set Output Drive State Register.">
		<bitfield id="SET5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 5 bits. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SET4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 4 bits. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_DATA45" acronym="GPIO_CLR_DATA45" offset="108" width="32" description="Clear Output Drive State Register.">
		<bitfield id="CLR5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLR4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_IN_DATA45" acronym="GPIO_IN_DATA45" offset="112" width="32" description="Bank Status Register.">
		<bitfield id="IN5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 5 bits." range="31:16" rwaccess="R"/>
	<bitfield id="IN4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits." range="15:0" rwaccess="R"/>
	</register><register id="GPIO_SET_RIS_TRIG45" acronym="GPIO_SET_RIS_TRIG45" offset="116" width="32" description="Set Rising Edge Detection Register.">
		<bitfield id="SETRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 5 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 4 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_RIS_TRIG45" acronym="GPIO_CLR_RIS_TRIG45" offset="120" width="32" description="Clear Rising Edge Detection Register.">
		<bitfield id="CLRRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 5 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 4 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_SET_FAL_TRIG45" acronym="GPIO_SET_FAL_TRIG45" offset="124" width="32" description="Set Falling Edge Detection Register.">
		<bitfield id="SETFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 5 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 4 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_FAL_TRIG45" acronym="GPIO_CLR_FAL_TRIG45" offset="128" width="32" description="Clear Falling Edge Detection Register.">
		<bitfield id="CLRFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 5 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 4 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_INTSTAT45" acronym="GPIO_INTSTAT45" offset="132" width="32" description="Bank Interrupt Status Register.">
		<bitfield id="STAT5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="STAT4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_DIR67" acronym="GPIO_DIR67" offset="136" width="32" description="Direction Register.">
		<bitfield id="DIR7" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 7 bits, 0 = output, 1 = input." range="31:16" rwaccess="R/W"/>
	<bitfield id="DIR6" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 6 bits, 0 = output, 1 = input." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_OUT_DATA67" acronym="GPIO_OUT_DATA67" offset="140" width="32" description="Output Drive State Register.">
		<bitfield id="OUT7" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 7 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="31:16" rwaccess="R/W"/>
	<bitfield id="OUT6" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 6 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_SET_DATA67" acronym="GPIO_SET_DATA67" offset="144" width="32" description="Set Output Drive State Register.">
		<bitfield id="SET7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 7 bits. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SET6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 6 bits. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_DATA67" acronym="GPIO_CLR_DATA67" offset="148" width="32" description="Clear Output Drive State Register.">
		<bitfield id="CLR7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLR6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_IN_DATA67" acronym="GPIO_IN_DATA67" offset="152" width="32" description="Bank Status Register.">
		<bitfield id="IN7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 7 bits." range="31:16" rwaccess="R"/>
	<bitfield id="IN6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits." range="15:0" rwaccess="R"/>
	</register><register id="GPIO_SET_RIS_TRIG67" acronym="GPIO_SET_RIS_TRIG67" offset="156" width="32" description="Set Rising Edge Detection Register.">
		<bitfield id="SETRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 7 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 6 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_RIS_TRIG67" acronym="GPIO_CLR_RIS_TRIG67" offset="160" width="32" description="Clear Rising Edge Detection Register.">
		<bitfield id="CLRRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 7 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 6 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_SET_FAL_TRIG67" acronym="GPIO_SET_FAL_TRIG67" offset="164" width="32" description="Set Falling Edge Detection Register.">
		<bitfield id="SETFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 7 bits." range="31:16" rwaccess="R/W1TS"/>
	<bitfield id="SETFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 6 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_FAL_TRIG67" acronym="GPIO_CLR_FAL_TRIG67" offset="168" width="32" description="Clear Falling Edge Detection Register.">
		<bitfield id="CLRFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 7 bits." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="CLRFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 6 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_INTSTAT67" acronym="GPIO_INTSTAT67" offset="172" width="32" description="Bank Interrupt Status Register.">
		<bitfield id="STAT7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31:16" rwaccess="R/W1TC"/>
	<bitfield id="STAT6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_DIR8" acronym="GPIO_DIR8" offset="176" width="32" description="Direction Register.">
		<bitfield id="DIR8" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 8 bits, 0 = output, 1 = input." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_OUT_DATA8" acronym="GPIO_OUT_DATA8" offset="180" width="32" description="Output Drive State Register.">
