ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/GPIO_GPIO_52000000h.xml
		<bitfield id="OUT8" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 8 bits, does not effect operation when it is configured as input. Reading it returns the output drive state." range="15:0" rwaccess="R/W"/>
	</register><register id="GPIO_SET_DATA8" acronym="GPIO_SET_DATA8" offset="184" width="32" description="Set Output Drive State Register.">
		<bitfield id="SET8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 8 bits. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_DATA8" acronym="GPIO_CLR_DATA8" offset="188" width="32" description="Clear Output Drive State Register.">
		<bitfield id="CLR8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_IN_DATA8" acronym="GPIO_IN_DATA8" offset="192" width="32" description="Bank Status Register.">
		<bitfield id="IN8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits." range="15:0" rwaccess="R"/>
	</register><register id="GPIO_SET_RIS_TRIG8" acronym="GPIO_SET_RIS_TRIG8" offset="196" width="32" description="Set Rising Edge Detection Register.">
		<bitfield id="SETRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 8 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_RIS_TRIG8" acronym="GPIO_CLR_RIS_TRIG8" offset="200" width="32" description="Clear Rising Edge Detection Register.">
		<bitfield id="CLRRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 8 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_SET_FAL_TRIG8" acronym="GPIO_SET_FAL_TRIG8" offset="204" width="32" description="Set Falling Edge Detection Register.">
		<bitfield id="SETFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 8 bits." range="15:0" rwaccess="R/W1TS"/>
	</register><register id="GPIO_CLR_FAL_TRIG8" acronym="GPIO_CLR_FAL_TRIG8" offset="208" width="32" description="Clear Falling Edge Detection Register.">
		<bitfield id="CLRFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 8 bits." range="15:0" rwaccess="R/W1TC"/>
	</register><register id="GPIO_INTSTAT8" acronym="GPIO_INTSTAT8" offset="212" width="32" description="Bank Interrupt Status Register.">
		<bitfield id="STAT8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15:0" rwaccess="R/W1TC"/>
	</register>
</module>